import React, { Component } from 'react';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'

class SectionTypographyEnglish extends Component {
  render() {
    return (
      <>
        <code className="sectionHeader"><FontAwesomeIcon icon="language"/> RU-RU</code>
        <h1>
          Заголовок Один
          <span>Заголовок страницы / Макс. 1</span>
        </h1>
        <h2>
          Заголовок Два
          <span>Раздел / Заголовок</span>
        </h2>
        <h3>
          Заголовок три
          <span>Раздел / Заголовок / Подкласс</span>
        </h3>
        <h4>
          Заголовок Четыре
          <span>Элемент / Заголовок</span>
        </h4>
        <h5>
          Заголовок пятый
          <span>Элемент / Заголовок / Подчиненный</span>
        </h5>
        <h6>
          Заголовок Шесть
          <span>Элемент / Заголовок / Третичный</span>
        </h6>
        <hr/>
        <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
        <hr/>
        <div className="typographyElementExample">
          <h4>Пример элемента / h4</h4>
          <div>
            <h5>Шаг 1. Альфа / h5</h5>
            <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
          </div>
          <div>
            <h5>Шаг 2. Бета / h5</h5>
            <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
            <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
          </div>
          <div>
            <h5>Шаг 3: Чарли / h5</h5>
            <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
            <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
            <p>Абзац (от древнегреческого παράγραφος paragraphos, «писать рядом» или «написано рядом») - это отдельная единица дискурса в письме, касающаяся определенной точки или идеи. Абзац состоит из более чем одного предложения. [1] [2] Хотя синтаксис любого языка не требуется, абзацы обычно являются ожидаемой частью формального письма, используемого для организации более длинной прозы.</p>
          </div>
        </div>
      </>
    );
  }

}

export default SectionTypographyEnglish;
