import React, { Component } from 'react';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'

class SectionTypographyEnglish extends Component {
  render() {
    return (
      <div className="locale_AR-AR">
        <code className="localeCode"><FontAwesomeIcon icon="language"/> AR-AR</code>
        <h1>
          العنوان الأول
          <span>رأس الصفحة / الحد الأقصى. 1</span>
        </h1>
        <h2>
          العنوان الثاني
          <span>مقطع الرأس</span>
        </h2>
        <h3>
          العنوان الثالث
          <span>القسم / الرأس / الفرع</span>
        </h3>
        <h4>
          العنوان الرابع
          <span>العنصر / الرأس</span>
        </h4>
        <h5>
          العنوان الخامس
          <span>العنصر / الرأس / الفرع</span>
        </h5>
        <h6>
          العنوان السادس
          <span>العنصر / الرأس / التعليم العالي</span>
        </h6>
        <hr/>
        <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
        <hr/>
        <div className="typographyElementExample">
          <h4>مثال العنصر / h4</h4>
          <div>
            <h5>الخطوة 1: Alpha / h5</h5>
            <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
          </div>
          <div>
            <h5>الخطوة 2: بيتا / h5</h5>
            <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
            <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
          </div>
          <div>
            <h5>الخطوة 3: تشارلي / h5</h5>
            <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
            <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
            <p>فقرة (من اليونانية القديمة φοςαράγραφος paraos ، "للكتابة بجانب" أو "مكتوب بجانب") هي وحدة قائمة بذاتها من الخطاب في الكتابة تتعامل مع نقطة أو فكرة معينة. تتكون الفقرة من أكثر من جملة واحدة. [1] [2] على الرغم من أن الفقرات لا تتطلبها بنية أي لغة ، إلا أن الفقرات عادة ما تكون جزءًا متوقعًا من الكتابة الرسمية ، وتستخدم لتنظيم النثر الأطول.</p>
          </div>
        </div>
      </div>
    );
  }

}

export default SectionTypographyEnglish;
