import React, { Component } from 'react';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'

class SectionTypographyEnglish extends Component {
  render() {
    return (
      <div className="locale_ZH-CN">
        <code className="localeCode"><FontAwesomeIcon icon="language"/> ZH-CN (Chinese Simplified)</code>
        <h1>
          标题一
          <span>页标题/最大1个</span>
        </h1>
        <h2>
          标题二
          <span>节/标题</span>
        </h2>
        <h3>
          标题三
          <span>节/标题/子</span>
        </h3>
        <h4>
          标题四
          <span>元素/标题</span>
        </h4>
        <h5>
          标题五
          <span>元素/标题/子元素</span>
        </h5>
        <h6>
          标题六
          <span>元素/标题/第三级</span>
        </h6>
        <hr/>
        <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
        <hr/>
        <div className="typographyElementExample">
          <h4>示例 / h4</h4>
          <div>
            <h5>步骤 1: Alpha / h5</h5>
            <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
          </div>
          <div>
            <h5>步骤 2: Beta / h5</h5>
            <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
            <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
          </div>
          <div>
            <h5>步骤 3: Charlie / h5</h5>
            <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
            <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
            <p>段落（来自古希腊παράγραφος段落、“写在旁边”或“写在旁边”）是论述特定观点或思想的书面论述的独立单元。一段包含一个以上的句子。 [1] [2]尽管任何语言的语法都没有要求、但段落通常是正式写作的预期组成部分、用于组织较长的散文。</p>
          </div>
        </div>
      </div>
    );
  }

}

export default SectionTypographyEnglish;
