import React, { Component } from 'react';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'

class SectionTypographyEnglish extends Component {
  render() {
    return (
      <div className="locale_JA-JP">
        <code className="localeCode"><FontAwesomeIcon icon="language"/> JA-JP</code>
        <h1>
          見出し1
          <span>ページヘッダー / 最大1</span>
        </h1>
        <h2>
          見出し2
          <span>セクション / ヘッダー</span>
        </h2>
        <h3>
          見出し3
          <span>セクション / ヘッダー / サブ</span>
        </h3>
        <h4>
          見出し4
          <span>要素 / ヘッダー</span>
        </h4>
        <h5>
          見出し5
          <span>要素 / ヘッダー / サブ</span>
        </h5>
        <h6>
          見出し6
          <span>要素 / ヘッダー / 三次</span>
        </h6>
        <hr/>
        <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
        <hr/>
        <div className="typographyElementExample">
          <h4>要素の例 / h4</h4>
          <div>
            <h5>ステップ1：アルファ / h5</h5>
            <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
          </div>
          <div>
            <h5>ステップ 2: ベータ / h5</h5>
            <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
            <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
          </div>
          <div>
            <h5>ステップ 3: チャーリー / h5</h5>
            <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
            <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
            <p>パラグラフ（古代ギリシャ語のααράγραφοςパラゴスから、「横に書く」または「横に書く」）は、特定のポイントまたはアイデアを扱う執筆における談話の自己完結型の単位です。段落は複数の文で構成されています。 [1] [2]どの言語の構文でも必須ではありませんが、通常、段落は正式な記述の予想される部分であり、長い散文を編成するために使用されます。</p>
          </div>
        </div>
      </div>
    );
  }

}

export default SectionTypographyEnglish;
